
# Welcome to 问答不回答

版主是正在就读于英国诺丁汉大学的计算机博士生，主攻方向是 Conversational Dialogue。大家都知道做科研是苦逼的，需要看 paper，看模型，写模型，模型效果不好再反复 reflect。概率非常大的情况是不论怎么修改，理论上 work 的模型，实际跑起来就是不 work，进而沉迷自闭不能自拔。经常一个人走在路上进入唐僧模式：“路漫漫，修远兮，今晚修不完明天修；路漫漫……”。

## 问答不回答初衷

不管今天修还是明天修，早晚都是要修的嘛。所以这个**问答不回答**专栏就是作为修坑的路上记录坑位的小本本。主要目的是版主自己 reflect 的过程记录，次要作用可能还有那么一丢丢可能能帮助马上入坑的小伙伴们（要是有小伙伴能看到的话）。问啥叫问答不回答呢，也是脑袋一热。现在这些个问答理论，咳，就真的是问答理论。能回答问题么？还不能回答。等哪天真的突破了当前的技术瓶颈，进入到下一阶段（可能是起码能回答好训练集里的问题了），那我就把这专栏名字改成“问答回答啦！”。

## 成文逻辑

大概的成文逻辑是：

* 问答理论路上非常重要的 paper 们，那是肯定要介绍一下滴。
* 版主自己科研过程中，重新实现过的文章 + 代码，是要记录一下的。

为了系统点的总结，每篇文章以【】开头来标注，以方便自己和小伙伴们。如：

* “【重要系列 1】基于 Attention 机制的 Sequence-to-Sequence 模型”
* “【Knowledge-Injecting 系列 1】记忆网络 （Memory Network）”

## 转载许可

要是各位大神，小神，十二金仙们觉得某篇还可以，欢迎广泛转载，但是还请注明出自于知乎专栏-问答不回答，再附上相应的原文链接就可以啦。

话不多说，咱们【重要系列 1】走起。
